In [1]:
import pandas as pd

In [2]:
PATH = r"./data/"

# Data Downloading
sales_df = pd.read_csv(PATH + "shop_sales" + ".csv")
dates_df = pd.read_csv(PATH + "shop_sales_dates" + ".csv")
price_df = pd.read_csv(PATH + "shop_sales_prices" + ".csv")

# EDA

## sales_df

In [3]:
sales_df.head()

       item_id store_id  date_id  cnt
0  STORE_2_085  STORE_2        1    3
1  STORE_2_085  STORE_2        2    8
2  STORE_2_085  STORE_2        3    0
3  STORE_2_085  STORE_2        4    3
4  STORE_2_085  STORE_2        5    0

In [4]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81855 entries, 0 to 81854
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   item_id   81855 non-null  object
 1   store_id  81855 non-null  object
 2   date_id   81855 non-null  int64
 3   cnt       81855 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.5+ MB

In [6]:
sales_df.describe()

            date_id           cnt
count  81855.000000  81855.000000
mean     910.000000     23.201405
std      525.103198     36.935855
min        1.000000      0.000000
25%      455.000000      1.000000
50%      910.000000      9.000000
75%     1365.000000     32.000000
max     1819.000000    763.000000

## price_df

In [9]:
price_df.head()

  store_id      item_id  wm_yr_wk  sell_price
0  STORE_2  STORE_2_085     11101        1.00
1  STORE_2  STORE_2_043     11101        2.88
2  STORE_2  STORE_2_054     11101        2.28
3  STORE_2  STORE_2_090     11101        1.25
4  STORE_2  STORE_2_252     11101        1.48

In [10]:
price_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11141 entries, 0 to 11140
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   store_id    11141 non-null  object
 1   item_id     11141 non-null  object
 2   wm_yr_wk    11141 non-null  int64
 3   sell_price  11141 non-null  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 348.3+ KB

## dates_df

In [11]:
dates_df.head()

,date,wm_yr_wk,weekday,wday,month,year,event_name_1,event_type_1,event_name_2,event_type_2,date_id,CASHBACK_STORE_1,CASHBACK_STORE_2,CASHBACK_STORE_3
0,2011-01-29,11101,Saturday,1,1,2011,NaN,NaN,NaN,NaN,1,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,NaN,NaN,NaN,NaN,2,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,NaN,NaN,NaN,NaN,3,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,NaN,NaN,NaN,NaN,4,0,1,1
4,2011-02-02,11101,Wednesday,5,2,2011,NaN,NaN,NaN,NaN,5,1,1,0

In [12]:
dates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1819 entries, 0 to 1818
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   date              1819 non-null   object
 1   wm_yr_wk          1819 non-null   int64
 2   weekday           1819 non-null   object
 3   wday              1819 non-null   int64
 4   month             1819 non-null   int64
 5   year              1819 non-null   int64
 6   event_name_1      146 non-null    object
 7   event_type_1      146 non-null    object
 8   event_name_2      4 non-null      object
 9   event_type_2      4 non-null      object
 10  date_id           1819 non-null   int64
 11  CASHBACK_STORE_1  1819 non-null   int64
 12  CASHBACK_STORE_2  1819 non-null   int64
 13  CASHBACK_STORE_3  1819 non-null   int64
dtypes: int64(8), object(6)
memory usage: 199.1+ KB

üü©üü®üü•

**‚Äî‚Äî üëÅÔ∏è‚Äçüó®Ô∏è¬†–ù–∞–±–ª—é–¥–µ–Ω–∏—è üëÅÔ∏è‚Äçüó®Ô∏è¬†‚Äî‚Äî**

1. **–ü—Ä–æ–ø—É—Å–∫–∏**
   1. üü© –í `price_df`, –Ω–µ—Ç –ø—Ä–æ–ø—É—Å–∫–æ–≤.
   2. üü© –í `sales_df` –Ω–µ—Ç –ø—Ä–æ–ø—É—Å–∫–æ–≤.
   3. üü• –í `dates_df` –µ—Å—Ç—å –ø—Ä–æ–ø—É—Å–∫–∏ –≤ –∫–æ–ª–æ–Ω–∫–∞—Ö —Å –ø—Ä–æ–º–æ–∞–∫—Ü–∏—è–º–∏.
2.